renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
/*============================ INCLUDES ======================================*/
#if !defined(__ARMCOMPILER_VERSION)
#include <byteswap.h>
#endif

#include "hal_data.h"
#include "lcd.h"

#if LCD_DIRVER == LCD_DRIVER_ST7796U

/*============================ MACROS ========================================*/

#define ST7796U_INTERFACE_8080_18BIT        0x00
#define ST7796U_INTERFACE_8080_09BIT        0x01
#define ST7796U_INTERFACE_8080_16BIT        0x02
#define ST7796U_INTERFACE_8080_08BIT        0x03
#define ST7796U_INTERFACE_3SPI              0x05
#define ST7796U_INTERFACE_MIPI              0x06
#define ST7796U_INTERFACE_4SPI              0x07
#define ST7796U_INTERFACE_RGB               0x10

/**
 * @def		__ST7796U_INTERFACE
 * @brief	Select ST7796U interface
 * @details	Options
 * 			ST7796U_INTERFACE_MIPI
 * 			ST7796U_INTERFACE_4SPI
 * 				Due to the use of MISO in the PCB design to control RCX,
 * 				So even if the module is set to the 4SPI mode, it can't read back data
 * 			ST7796U_INTERFACE_RGB
 * 				It still need SPI interface to config screen
 */
#ifndef __ST7796U_INTERFACE
#define __ST7796U_INTERFACE     ST7796U_INTERFACE_4SPI
#endif

#ifndef __ST7796U_DEBUG
#define __ST7796U_DEBUG			0
#endif

#ifndef ST7796U_PIN_RESET
#define ST7796U_PIN_RESET		BSP_IO_PORT_13_PIN_07
#endif

#ifndef ST7796U_PIN_BACKLIGHT
#define ST7796U_PIN_BACKLIGHT	BSP_IO_PORT_13_PIN_05
#endif

#if __ST7796U_DEBUG
#include "utils/log.h"
#define UNLIKE_RETURN(v, t, msg, ...) if (v != t) { LOG_E(__FUNCTION__, msg, ##__VA_ARGS__); return; }
#else
#define UNLIKE_RETURN(v, t, msg, ...) if (v != t) { return; }
#endif

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

#include "r_sci_b_spi_cfg.h"

/**
 * @def		ST7796U_4SPI_EN_CACHE
 * @brief	Whether to use caching
 * @note	Only verified in it set 1
 */
#ifndef ST7796U_4SPI_EN_CACHE
#define ST7796U_4SPI_EN_CACHE           1
#endif

#if ST7796U_4SPI_EN_CACHE

#ifndef ST7796U_4SPI_EN_DOUBLE_CACHE
/* NOTE: Unimplemented, don't use */
#define ST7796U_4SPI_EN_DOUBLE_CACHE    0
#endif

#ifndef ST7796U_CACHE_SIZE
#define ST7796U_CACHE_SIZE              (222 * 480 * 2)
#endif

#endif

#define ST7796U_SPI_INSTANCE	g_sci_spi8
#define ST7796U_SPI_CALLBACK	SCI8_SPI_Callback
#define ST7796U_SPI_HARD_CS		1
#define ST7796U_PIN_SPI_CLK		BSP_IO_PORT_13_PIN_01
#define ST7796U_PIN_SPI_MOSI	BSP_IO_PORT_13_PIN_02
#define ST7796U_PIN_SPI_MISO	BSP_IO_PORT_13_PIN_03
#define ST7796U_PIN_SPI_CS      BSP_IO_PORT_13_PIN_04
#define ST7796U_PIN_DCX         BSP_IO_PORT_13_PIN_05

#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI

#define ST7796U_GLCDC_INSTANCE  g_lcdc
#define ST7796U_GLCDC_CALLBACK  GLCDC_Callback
#define ST7796U_MIPI_INSTANCE   g_mipi_dsi0
#define ST7796U_MIPI_CALLBACK   MIPI_DSI_Callback

#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI */

#define DEFAULT_TIMEOUT         200

/*============================ TYPES =========================================*/
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
typedef struct lcd_mipi_table_setting
{
    unsigned char size;
    unsigned char buffer[15];
    mipi_cmd_id_t cmd_id;
    mipi_dsi_cmd_flag_t flags;
} lcd_mipi_table_setting_t;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
typedef struct lcd_spi_table_setting {
    const uint8_t *cmd;
    uint8_t length;
    uint8_t val[16];
} lcd_spi_table_setting_t;

typedef enum lcd_spi_clk_select {
    SPI_CLK_READ,
    SPI_CLK_WRITE
} lcd_spi_clk_select_t;
#endif

/*============================ GLOBAL VARIABLES ==============================*/
/*============================ LOCAL VARIABLES ===============================*/

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
static uint8_t s_mipi_tx_done;
static uint8_t s_glcdc_vsync_flag;
/* This table of commands was adapted from sample code provided by FocusLCD
 * Page Link: https://focuslcds.com/product/4-5-tft-display-capacitive-tp-e45ra-mw276-c/
 * File Link: https://focuslcds.com/content/E45RA-MW276-C_init_code.txt */
static const lcd_mipi_table_setting_t sc_lcd_mipi_init_table[] = {
    {2, {0x11, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0xC3}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x96}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x36, 0x48}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x3A, 0x55}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xB4, 0x01}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {4, {0xB6, 0x8A, 0x07, 0x3B}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xB7, 0xC6}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {3, {0xB9, 0x02, 0xE0}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {3, {0xC0, 0xC0, 0x64}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC1, 0x1D}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC2, 0xA7}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xC5, 0x18}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {9, {0xE8, 0x40, 0x8A, 0x00, 0x00, 0x29, 0x19, 0xA5, 0x33}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {15, {0xE0, 0xF0, 0x0B, 0x12, 0x09, 0x0A, 0x26, 0x39, 0x54, 0x4E, 0x38, 0x13, 0x13, 0x2E, 0x34}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {15, {0xE1, 0xF0, 0x10, 0x15, 0x0D, 0x0C, 0x07, 0x38, 0x43, 0x4D, 0x3A, 0x16, 0x15, 0x30, 0x35}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x3C}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0xF0, 0x69}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x35, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x29, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x21, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {5, {0x2A, 0x00, 0x31, 0x01, 0x0E}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {5, {0x2B, 0x00, 0x00, 0x01, 0xDF}, MIPI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
    {2, {0x2C, 0x00}, MIPI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
};
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

