renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
#if ST7796U_SPI_HARD_CS == 0
static uint8_t s_spi_sequence_end;
#endif

static uint8_t s_spi_transfer_done = 1;

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-const-variable"
#endif
/* Command Table 1 */
static const uint8_t sc_cmd_nop = 0x00;
static const uint8_t sc_cmd_swreset = 0x01;
static const uint8_t sc_cmd_rddid = 0x04;
static const uint8_t sc_cmd_read_num_of_dsi_err = 0x05;
static const uint8_t sc_cmd_rddst = 0x09;
static const uint8_t sc_cmd_rddpm = 0x0A;
static const uint8_t sc_cmd_rddmadctl = 0x0B;
static const uint8_t sc_cmd_rddcolmod = 0x0C;
static const uint8_t sc_cmd_rddim = 0x0D;
static const uint8_t sc_cmd_rddsm = 0x0E;
static const uint8_t sc_cmd_rddsdr = 0x0F;
static const uint8_t sc_cmd_slpin = 0x10;
static const uint8_t sc_cmd_slpout = 0x11;
static const uint8_t sc_cmd_ptlon = 0x12;
static const uint8_t sc_cmd_noron = 0x13;
static const uint8_t sc_cmd_invoff = 0x20;
static const uint8_t sc_cmd_invon = 0x21;
static const uint8_t sc_cmd_dispoff = 0x28;
static const uint8_t sc_cmd_dispon = 0x29;
static const uint8_t sc_cmd_caset = 0x2A;
static const uint8_t sc_cmd_raset = 0x2B;
static const uint8_t sc_cmd_ramwr = 0x2C;
static const uint8_t sc_cmd_ramrd = 0x2E;
static const uint8_t sc_cmd_ptlar = 0x30;
static const uint8_t sc_cmd_vscrdef = 0x33;
static const uint8_t sc_cmd_teoff = 0x34;
static const uint8_t sc_cmd_teon = 0x35;
static const uint8_t sc_cmd_madctl = 0x36;
static const uint8_t sc_cmd_vscsad = 0x37;
static const uint8_t sc_cmd_idmoff = 0x38;
static const uint8_t sc_cmd_idmon = 0x39;
static const uint8_t sc_cmd_colmod = 0x3A;
static const uint8_t sc_cmd_wrmemc = 0x3C;
static const uint8_t sc_cmd_rdmemc = 0x3E;
static const uint8_t sc_cmd_ste = 0x44;
static const uint8_t sc_cmd_gscan = 0x45;
static const uint8_t sc_cmd_wrdisbv = 0x51;
static const uint8_t sc_cmd_rddisbv = 0x52;
static const uint8_t sc_cmd_wrctrld = 0x53;
static const uint8_t sc_cmd_rdctrld = 0x54;
static const uint8_t sc_cmd_wrcabc = 0x55;
static const uint8_t sc_cmd_rdcabc = 0x56;
static const uint8_t sc_cmd_wrcabcmb = 0x5E;
static const uint8_t sc_cmd_rdcabcmb = 0x5F;
static const uint8_t sc_cmd_rdfcs = 0xAA;
static const uint8_t sc_cmd_rdcfcs = 0xAF;
static const uint8_t sc_cmd_rdid1 = 0xDA;
static const uint8_t sc_cmd_rdid2 = 0xDB;
static const uint8_t sc_cmd_rdid3 = 0xDC;
/* Command Table 2 */
static const uint8_t sc_cmd_ifmode = 0xB0;
static const uint8_t sc_cmd_frmctr1 = 0xB1;
static const uint8_t sc_cmd_frmctr2 = 0xB2;
static const uint8_t sc_cmd_frmctr3 = 0xB3;
static const uint8_t sc_cmd_dic = 0xB4;
static const uint8_t sc_cmd_bpc = 0xB6;
static const uint8_t sc_cmd_em = 0xB7;
static const uint8_t sc_cmd_modesel = 0xB9;
static const uint8_t sc_cmd_pwr1 = 0xC0;
static const uint8_t sc_cmd_pwr2 = 0xC1;
static const uint8_t sc_cmd_pwr3 = 0xC2;
static const uint8_t sc_cmd_vcmpctl = 0xC5;
static const uint8_t sc_cmd_vcm_offset = 0xC6;
static const uint8_t sc_cmd_nvmadw = 0xD0;
static const uint8_t sc_cmd_nvmbprog = 0xD1;
static const uint8_t sc_cmd_nvm_status_read = 0xD2;
static const uint8_t sc_cmd_rdid4 = 0xD3;
static const uint8_t sc_cmd_pgc = 0xE0;
static const uint8_t sc_cmd_ngc = 0xE1;
static const uint8_t sc_cmd_dgc1 = 0xE2;
static const uint8_t sc_cmd_dgc2 = 0xE3;
static const uint8_t sc_cmd_doca = 0xE8;
static const uint8_t sc_cmd_cscon = 0xF0;
static const uint8_t sc_cmd_spi_read_control = 0xFB;

/* If lcd_spi_table_setting_t::cmd is NULL, that means delay lcd_spi_table_setting_t::length ms */
static const lcd_spi_table_setting_t sc_lcd_setting_table[] = {
    {NULL           , 120, {0x00}},
    {&sc_cmd_slpout , 0  , {0x00}},
    {NULL           , 120, {0x00}},
    {&sc_cmd_cscon  , 1  , {0xC3}},
    {&sc_cmd_cscon  , 1  , {0x96}},
    {&sc_cmd_madctl , 1  , {0x48}},
    {&sc_cmd_colmod , 1  , {0x55}},
    {&sc_cmd_dic    , 1  , {0x01}},
    {&sc_cmd_bpc    , 3  , {0x8A, 0x07, 0x3B}},
    {&sc_cmd_em     , 1  , {0xC6}},
    {&sc_cmd_modesel, 2  , {0x02, 0xE0}},
    {&sc_cmd_pwr1   , 2  , {0xC0, 0x64}},
    {&sc_cmd_pwr2   , 1  , {0x1D}},
    {&sc_cmd_pwr3   , 1  , {0xA7}},
    {&sc_cmd_vcmpctl, 1  , {0x18}},
    {&sc_cmd_doca   , 8  , {0x40, 0x8A, 0x00, 0x00, 0x29, 0x19, 0xA5, 0x33}},
    {&sc_cmd_pgc    , 14 , {0xF0, 0x0B, 0x12, 0x09, 0x0A, 0x26, 0x39, 0x54, 0x4E, 0x38, 0x13, 0x13, 0x2E, 0x34}},
    {&sc_cmd_ngc    , 14 , {0xF0, 0x10, 0x15, 0x0D, 0x0C, 0x07, 0x38, 0x43, 0x4D, 0x3A, 0x16, 0x15, 0x30, 0x35}},
    {&sc_cmd_teon   , 1  , {0x00}},
    {&sc_cmd_invon  , 0  , {0x00}},
    {&sc_cmd_caset  , 4  , {0x00, 0x00, 0x01, 0x0E}},
    {&sc_cmd_raset  , 4  , {0x00, 0x00, 0x01, 0xDF}},
	{&sc_cmd_cscon  , 1  , {0x3C}},
    {&sc_cmd_cscon  , 1  , {0x69}},
	{&sc_cmd_dispon , 0  , {0x00}},
};
#if defined(__clang__)
#pragma clang diagnostic pop
#endif

/* When SCICLK is 120MHz, this config set SCI_SPI clock to 6MHz.
 * This clock config is for reading, must less then 6.66MHz */
static const sci_b_spi_extended_cfg_t sc_spi_read_clk_config = {
    .clk_div = { .cks = 0, .brr = 9, .bgdm = 1 },
    .clock_source = SCI_B_SPI_SOURCE_CLOCK_SCISPICLK
};

/* It will copy from FSP generation when call LCD_PortInit.
 * This clock config is for writing. */
static sci_b_spi_extended_cfg_t s_spi_write_clk_config;

#if ST7796U_4SPI_EN_CACHE
#if ST7796U_4SPI_EN_DOUBLE_CACHE
static uint8_t s_spi_frame_cache[2][ST7796U_CACHE_SIZE];
static uint8_t s_spi_frame_current;
#else
static uint8_t s_spi_frame_cache[1][ST7796U_CACHE_SIZE];
#endif
#endif

#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI */

/*============================ PROTOTYPES ====================================*/
#pragma clang diagnostic ignored "-Wunused-function"

static void hardReset(void);

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
static void readMemory(uint8_t *val, uint32_t length);
static void readRegister(const uint8_t *reg, uint8_t *val, uint32_t length);
static void setClock(lcd_spi_clk_select_t select);
static void setCursor(LCD_Device *device, uint16_t x, uint16_t y);
static void setRenderArea(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width);
static void waitTransferDone(uint32_t timeout_ms);
static void writeMemory(const uint8_t *val, uint32_t length);
static void writeRegister(const uint8_t *reg, const uint8_t *val, uint32_t length);
#endif

/*============================ PUBLIC FUNCTIONS ==============================*/
/**
 * @brief	Draw bitmap
 * @param	device A lcd device pointer
 * @param	x      X start position
 * @param	y      Y start position
 * @param	length Length of X-axis
 * @param	width  Length of Y-axis
 * @param	bitmap Bitmap pointer, must be RGB565 format and don't swap the high and low bytes
 * @retval	0: Success
 * 			1: x or y out of range
 */
uint32_t LCD_PortDrawBitmap(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width, const uint8_t *bitmap)
{
	if ((length == 0) || (width == 0)) {
        return 0;
    }
	if ((x >= device->length) || (y >= device->width)) {
	#if __ST7796U_DEBUG
		LOG_W(__FUNCTION__, "[%u, %u] out of range", x, y);
	#endif
		return 1;
	}
	if ((x + length) > device->length) {
		length = device->length - x;
	}
	if ((y + width) > device->width) {
		width = device->width - y;
	}

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "x = %u, y = %u, length = %u, width = %u", x, y, length, width);
#endif

