renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	uint16_t i;
    uint16_t *p16_bg = (uint16_t *)&fb_background[0][0];
    uint32_t *p32_bg = (uint32_t *)&fb_background[0][0];
    const uint16_t *p16_bitmap = (const uint16_t *)bitmap;
    const uint32_t *p32_bitmap = (const uint32_t *)bitmap;

    switch (device->color_format) {
    case COLOR_FORMAT_ARGB8888:
    case COLOR_FORMAT_RGB888:
        p32_bg = &p32_bg[y * device->length + x];
        for (i = 0; i < width; i++) {
            memcpy(p32_bg, p32_bitmap, length);
            p32_bg = &p32_bg[device->length + device->length_dummy];
            p32_bitmap = &p32_bitmap[length];
        }
        break;
    case COLOR_FORMAT_ARGB1555:
    case COLOR_FORMAT_ARGB4444:
    case COLOR_FORMAT_RGB565:
        p16_bg = &p16_bg[y * device->length + x];
        for (i = 0; i < width; i++) {
            memcpy(p16_bg, p16_bitmap, length);
            p16_bg = &p16_bg[device->length + device->length_dummy];
            p16_bitmap = &p16_bitmap[length];
        }
        break;
    default:
        break;
    }
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
	uint16_t i, j;

	uint16_t src_length = length;
	const uint16_t *p16_bitmap = (const uint16_t *)bitmap;

#if ST7796U_4SPI_EN_CACHE

	uint16_t *p16_cache = (uint16_t *)&s_spi_frame_cache[0];
	uint32_t index = x + y * device->length;

	for (i = 0; i < width; i++) {
		for (j = 0; j < length; j++) {
		#if defined(__ARMCOMPILER_VERSION)
			p16_cache[index + j] = p16_bitmap[i * src_length + j] >> 8;
			p16_cache[index + j] |= p16_bitmap[i * src_length + j] << 8;
		#else
			p16_cache[index + j] = bswap_16(p16_bitmap[i * src_length + j]);
		#endif
		}
		index += device->length;
	}

	setCursor(device, 0, y);
	writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    s_spi_sequence_end = 1;
#endif
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &p16_cache[y * device->length], width * device->length * 2, SPI_BIT_WIDTH_8_BITS);
#else
    uint16_t color;

    setRenderArea(device, x, y, length, width);
    writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    for (i = 0; i < width; i++) {
    	for (j = 0; j < length; j++) {
		#if defined(__ARMCOMPILER_VERSION)
			color = p16_bitmap[i * src_length + j] >> 8;
			color |= p16_bitmap[i * src_length + j] << 8;
		#else
			color = bswap_16(p16_bitmap[i * src_length + j]);
		#endif
			R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &color, 2, SPI_BIT_WIDTH_8_BITS);
			waitTransferDone(DEFAULT_TIMEOUT);
    	}
    }
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
#endif

#endif
	return 0;
}

/**
 * @brief	Draw point
 * @note	Only validate in RGB565 mode and SPI interface
 * @param	device A lcd device pointer
 * @param	x      X-axis position
 * @param	y      Y-axis position
 * @param	color  Color value
 * @retval	0: Success
 * 			1: x or y out of range
 */
uint32_t LCD_PortDrawPoint(LCD_Device *device, uint16_t x, uint16_t y, uint32_t color)
{
	if ((x >= device->length) || (y >= device->width)) {
		return 1;
	}

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	(void)device;
	(void)x;
	(void)y;
	(void)color;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

#if ST7796U_4SPI_EN_CACHE
	uint16_t *p16_cache = NULL;
	uint32_t *p32_cache = NULL;
	uint32_t index = x + y * device->length;

	setCursor(device, x, y);
	if (device->color_format == COLOR_FORMAT_RGB565) {
		p16_cache = (uint16_t *)s_spi_frame_cache;
		p16_cache[index] = (uint16_t)color;
		writeMemory((uint8_t *)&p16_cache[index], 2);
	}
	else {
		p32_cache = (uint32_t *)s_spi_frame_cache;
		p32_cache[index] = color;
		writeMemory((uint8_t *)&p32_cache[index], 4);
	}
#else
	uint16_t color_16bit;
	uint32_t color_32bit;

	setCursor(device, x, y);
	if (device->color_format == COLOR_FORMAT_RGB565) {
		color_16bit = (uint16_t)color;
		writeMemory((uint8_t *)&color_16bit, 2);
	}
	else {
		color_32bit = color;
		writeMemory((uint8_t *)&color_32bit, 4);
	}
	waitTransferDone(DEFAULT_TIMEOUT);
#endif

#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI */

	return 0;
}

/**
 * @brief	Draw a solid rectangle
 * @param	device A lcd device pointer
 * @param	x      X start position
 * @param	y      Y start position
 * @param	length Length of X-axis
 * @param	width  Length of Y-axis
 * @param	color  Color value, only RGB565 format
 * @retval	0: Success or length or width is zero
 * 			1: x or y out of range
 */
uint32_t LCD_PortFillRectangle(LCD_Device *device, uint16_t x, uint16_t y, uint16_t length, uint16_t width, uint32_t color)
{
    if ((length == 0) || (width == 0)) {
	#if __ST7796U_DEBUG
    	LOG_W(__FUNCTION__, "Value chacke failed: length = %u, width = %u", length, width);
	#endif
        return 0;
    }
	if ((x >= device->length) || (y >= device->width)) {
	#if __ST7796U_DEBUG
		LOG_W(__FUNCTION__, "Value chacke failed: x = %u, y = %u", x, y);
	#endif
		return 1;
	}
	if ((x + length) > device->length) {
		length = device->length - x;
	}
	if ((y + width) > device->width) {
		width = device->width - y;
	}

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "x = %u, y = %u, length = %u, width = %u, color = 0x%04X", x, y, length, width, color);
#endif

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	uint16_t i, j;
    uint16_t *p16_bg = (uint16_t *)&fb_background[0][0];
    uint32_t *p32_bg = (uint32_t *)&fb_background[0][0];

    switch (device->color_format) {
    case COLOR_FORMAT_ARGB8888:
    case COLOR_FORMAT_RGB888:
        p32_bg = &p32_bg[y * (device->length + device->length_dummy)];
        for (i = 0; i < width; i++) {
            for (j = x; j < (x + length); j++) {
                p32_bg[j] = color;
            }
            p32_bg = &p32_bg[device->length + device->length_dummy];
        }
        break;
    case COLOR_FORMAT_ARGB1555:
    case COLOR_FORMAT_ARGB4444:
    case COLOR_FORMAT_RGB565:
        p16_bg = &p16_bg[y * (device->length + device->length_dummy)];
        for (i = 0; i < width; i++) {
            for (j = x; j < (x + length); j++) {
                p16_bg[j] = (uint16_t)color;
            }
            p16_bg = &p16_bg[device->length + device->length_dummy];
        }
        break;
    default:
        break;
    }
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI

