renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
#if ST7796U_4SPI_EN_CACHE
	uint16_t _color;
    uint32_t i, j;
    uint32_t index;

    uint16_t row_num = 0;
    uint16_t *p16_cache = NULL;
    uint32_t *p32_cache = NULL;

    if (device->color_format == COLOR_FORMAT_RGB565) {
	#if defined(__ARMCOMPILER_VERSION)
		_color = (uint16_t)((color >> 8) & 0xFF);
		_color |= (uint16_t)((color << 8) & 0xFF00);
	#else
		_color = bswap_16((uint16_t)color);
	#endif
    	index = x + y * device->length;
    	p16_cache = (uint16_t *)s_spi_frame_cache;
        for (i = 0; i < width; i++) {
            for (j = 0; j < length; j++) {
            	p16_cache[index + j] = _color;
            }
            index += device->length;
            row_num++;
        }
    }
    else {
    	index = x + y * device->length;
        p32_cache = (uint32_t *)s_spi_frame_cache;
        for (i = 0; i < width; i++) {
            for (j = 0; j < length; j++) {
                p32_cache[index + j] = color;
            }
            index += device->length;
            row_num++;
        }
    }

    setCursor(device, 0, y);
    writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    s_spi_sequence_end = 1;
#endif
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    if (device->color_format == COLOR_FORMAT_RGB565) {
        R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &p16_cache[y * device->length], row_num * device->length * 2, SPI_BIT_WIDTH_8_BITS);
    }
    else {
        R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &p32_cache[y * device->length], row_num * device->length * 4, SPI_BIT_WIDTH_8_BITS);
    }

#else
	uint8_t data_write[4];
	uint16_t i, j;

	uint16_t x_end = x + length;
	uint16_t y_end = y + width;

	if (device->color_format == COLOR_FORMAT_RGB565) {
		data_write[0] = (uint8_t)(color >> 8);
		data_write[1] = (uint8_t)color;
	}
	else {
		data_write[0] = (uint8_t)(color >> 24);
		data_write[1] = (uint8_t)(color >> 16);
		data_write[2] = (uint8_t)(color >> 8);
		data_write[3] = (uint8_t)color;
	}
    setRenderArea(device, x, y, length, width);
    writeRegister(&sc_cmd_ramwr, NULL, 0);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
	for (i = x; i < x_end; i++) {
		for (j = y; j < y_end; j++) {
			R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, data_write, 2, SPI_BIT_WIDTH_8_BITS);
            waitTransferDone(DEFAULT_TIMEOUT);
		}
	}
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
#endif

#endif

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "End");
#endif

	return 0;
}

/**
 * @brief	Fill the entire screen with the specified color
 * @param	device A lcd device pointer
 * @param	color  Color value, only RGB565 format
 * @retval	Always return 0
 */
uint32_t LCD_PortFillScreen(LCD_Device *device, uint32_t color)
{
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	uint32_t i;

    uint16_t *p16_bg = (uint16_t *)&fb_background[0][0];
    uint32_t *p32_bg = (uint32_t *)&fb_background[0][0];
    uint32_t total_pixel = device->length * device->width;

    switch (device->color_format) {
    case COLOR_FORMAT_ARGB8888:
    case COLOR_FORMAT_RGB888:
        for (i = 0; i < total_pixel; i++) {
            p32_bg[i] = color;
        }
        break;
    case COLOR_FORMAT_ARGB1555:
    case COLOR_FORMAT_ARGB4444:
    case COLOR_FORMAT_RGB565:
        for (i = 0; i < total_pixel; i++) {
            p16_bg[i] = (uint16_t)color;
        }
        break;
    default:
        break;
    }
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
	int i;
    uint8_t data_write[4];
    uint16_t row_start, row_end;
    uint16_t column_start, column_end;

    if ((device->orientation == SCREEN_ORIENTATION_HORIZONTAL) || (device->orientation == SCREEN_ORIENTATION_HORIZONTAL_FLIP)) {
    	row_start = 0x31;
    	row_end = device->width + 0x31;
    	column_start = 0;
    	column_end = device->length;
    }
    else {
    	row_start = 0;
    	row_end = device->width;
    	column_start = 0x31;
    	column_end = device->length + 0x31;
    }

#if __ST7796U_DEBUG
    LOG_D(__FUNCTION__, "row_start: %d", row_start);
    LOG_D(__FUNCTION__, "row_end: %d", row_end);
    LOG_D(__FUNCTION__, "column_start: %d", column_start);
    LOG_D(__FUNCTION__, "column_end: %d", column_end);
#endif

    waitTransferDone(DEFAULT_TIMEOUT);
    if (device->color_format == COLOR_FORMAT_RGB565) {
        data_write[0] = column_start >> 8;
        data_write[1] = (uint8_t)column_start;
        data_write[2] = (column_end - 1) >> 8;
        data_write[3] = (column_end - 1) & 0xFF;
    #if __ST7796U_DEBUG
        LOG_D(__FUNCTION__, "Set CASET");
	#endif
        writeRegister(&sc_cmd_caset, data_write, 4);
        waitTransferDone(DEFAULT_TIMEOUT);
        data_write[0] = row_start >> 8;
        data_write[1] = (uint8_t)row_start;
        data_write[2] = (row_end - 1) >> 8;
        data_write[3] = (row_end - 1) & 0xFF;
    #if __ST7796U_DEBUG
        LOG_D(__FUNCTION__, "Set RASET");
    #endif
        writeRegister(&sc_cmd_raset, data_write, 4);
        waitTransferDone(DEFAULT_TIMEOUT);
        writeRegister(&sc_cmd_ramwr, NULL, 0);
        waitTransferDone(DEFAULT_TIMEOUT);

    #if __ST7796U_DEBUG
        LOG_D(__FUNCTION__, "Fill Start");
    #endif
    #if ST7796U_4SPI_EN_CACHE
        data_write[0] = (uint8_t)(color >> 8);
        data_write[1] = (uint8_t)color;
        uint16_t *p_color = (uint16_t *)data_write;
    #if ST7796U_4SPI_EN_DOUBLE_CACHE
        s_spi_frame_current = s_spi_frame_current ? 0 : 1;
        uint16_t *p_cache = (uint16_t *)&s_spi_frame_cache[s_spi_frame_current];
    #else
        uint16_t *p_cache = (uint16_t *)s_spi_frame_cache;
    #endif
        for (i = 0; i < ST7796U_CACHE_SIZE / 2; i++) {
            p_cache[i] = *p_color;
        }
	#if ST7796U_SPI_HARD_CS == 0
        s_spi_sequence_end = 1;
	#endif
        R_BSP_PinAccessEnable();
        R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
        R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
        R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, p_cache, ST7796U_CACHE_SIZE, SPI_BIT_WIDTH_8_BITS);
    #else
	#if ST7796U_SPI_HARD_CS == 0
        s_spi_sequence_end = 0;
	#endif
        R_BSP_PinAccessEnable();
		R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
		R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
        data_write[0] = (uint8_t)(color >> 8);
        data_write[1] = (uint8_t)color;
		for (i = 0; i < (device->width * device->length); i++) {
			R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, data_write, 2, SPI_BIT_WIDTH_8_BITS);
			waitTransferDone(DEFAULT_TIMEOUT);
		}
		R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_HIGH);
	#if ST7796U_SPI_HARD_CS == 0
		s_spi_sequence_end = 1;
	#endif
    #endif
    }

#if __ST7796U_DEBUG
    LOG_D(__FUNCTION__, "Fill Done");
#endif

#endif

