renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
    return 0;
}

/**
 * @brief	Init a lcd device
 * @note	When __ST7796U_INTERFACE is ST7796U_INTERFACE_4SPI,
 * 			must set device->orientation = SCREEN_ORIENTATION_VERTICAL first.
 * 			Only this direction has been verified.
 * @param	device A lcd device pointer
 * @retval	Always return 0
 */
uint32_t LCD_PortInit(LCD_Device *device)
{
    ioport_instance_ctrl_t pin_ctrl;
    ioport_pin_cfg_t pin_cfg_data[6];
    ioport_cfg_t pin_cfg;
    size_t i, len_init_table;

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
    fsp_err_t err;
    mipi_dsi_cmd_t msg;

    /* e2 doesn't generate this pin config */
    pin_cfg_data[0].pin = ST7796U_PIN_RESET;
    pin_cfg_data[0].pin_cfg = (uint32_t)IOPORT_CFG_PORT_DIRECTION_OUTPUT | (uint32_t)IOPORT_CFG_PORT_OUTPUT_HIGH;
    pin_cfg.number_of_pins = 1;
    pin_cfg.p_pin_cfg_data = (ioport_pin_cfg_t const *)&pin_cfg_data;
    pin_cfg.p_extend = NULL;
    R_IOPORT_Open(&pin_ctrl, &pin_cfg);

    hardReset();
    memset(fb_background, 0x10, DISPLAY_BUFFER_STRIDE_BYTES_INPUT0 * DISPLAY_VSIZE_INPUT0);
    memset(&fb_background[1], 0x01, DISPLAY_BUFFER_STRIDE_BYTES_INPUT0 * DISPLAY_VSIZE_INPUT0);
    R_GLCDC_Open(ST7796U_GLCDC_INSTANCE.p_ctrl, ST7796U_GLCDC_INSTANCE.p_cfg);
    msg.channel = 0;
    len_init_table = sizeof(sc_lcd_mipi_init_table) / sizeof(sc_lcd_mipi_init_table[0]);
    for (i = 0; i < len_init_table; i++) {
        msg.cmd_id = sc_lcd_mipi_init_table[i].cmd_id;
        msg.flags = sc_lcd_mipi_init_table[i].flags;
        msg.p_tx_buffer = sc_lcd_mipi_init_table[i].buffer;
        msg.tx_len = sc_lcd_mipi_init_table[i].size;
        s_mipi_tx_done = 0;
        err = R_MIPI_DSI_Command(ST7796U_MIPI_INSTANCE.p_ctrl, &msg);
        if (err != FSP_SUCCESS) {
        #if __ST7796U_DEBUG
            LOG_E(__FUNCTION__, "MIPI_DSI_Command error: 0x%X", err);
        #endif
        }
        while (s_mipi_tx_done == 0) {
        #ifdef __OPTIMIZE__
            __nop();
        #endif
        }
    }
    R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
    R_GLCDC_Start(ST7796U_GLCDC_INSTANCE.p_ctrl);
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
    uint8_t data_read[8] = {0};

    /* LCD module reset pin */
    pin_cfg_data[0].pin = ST7796U_PIN_RESET;
    pin_cfg_data[0].pin_cfg = (uint32_t)IOPORT_CFG_PORT_DIRECTION_OUTPUT | (uint32_t)IOPORT_CFG_PORT_OUTPUT_HIGH;
    /* LCD module CSX pin, as SPI CS */
#if ST7796U_SPI_HARD_CS
    pin_cfg_data[1].pin = ST7796U_PIN_SPI_CS;
    pin_cfg_data[1].pin_cfg = (uint32_t)IOPORT_CFG_PERIPHERAL_PIN | (uint32_t)IOPORT_PERIPHERAL_SCI0_2_4_6_8 | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
#else
    pin_cfg_data[1].pin_cfg = (uint32_t)IOPORT_CFG_PORT_DIRECTION_OUTPUT | (uint32_t)IOPORT_CFG_PORT_OUTPUT_HIGH | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
#endif
    /* LCD module D/CX pin */
    pin_cfg_data[2].pin = ST7796U_PIN_DCX;
    pin_cfg_data[2].pin_cfg = (uint32_t)IOPORT_CFG_PORT_DIRECTION_OUTPUT | (uint32_t)IOPORT_CFG_PORT_OUTPUT_HIGH | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
    /* SCI4 Simple SPI: CLK */
    pin_cfg_data[3].pin = ST7796U_PIN_SPI_CLK;
    pin_cfg_data[3].pin_cfg = (uint32_t)IOPORT_CFG_PERIPHERAL_PIN | (uint32_t)IOPORT_PERIPHERAL_SCI0_2_4_6_8 | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
    /* SCI4 Simple SPI: MOSI */
    pin_cfg_data[4].pin = ST7796U_PIN_SPI_MOSI;
    pin_cfg_data[4].pin_cfg = (uint32_t)IOPORT_CFG_PERIPHERAL_PIN | (uint32_t)IOPORT_PERIPHERAL_SCI0_2_4_6_8 | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
    /* SCI4 Simple SPI: MISO */
    pin_cfg_data[5].pin = ST7796U_PIN_SPI_MISO;
    pin_cfg_data[5].pin_cfg = (uint32_t)IOPORT_CFG_PERIPHERAL_PIN | (uint32_t)IOPORT_PERIPHERAL_SCI0_2_4_6_8 | (uint32_t)IOPORT_CFG_DRIVE_HIGH;
    pin_cfg.number_of_pins = 6;
    pin_cfg.p_pin_cfg_data = (ioport_pin_cfg_t const *)&pin_cfg_data;
    pin_cfg.p_extend = NULL;
    R_IOPORT_Open(&pin_ctrl, &pin_cfg);
    R_SCI_B_SPI_Open(ST7796U_SPI_INSTANCE.p_ctrl, ST7796U_SPI_INSTANCE.p_cfg);
#if ST7796U_SPI_HARD_CS
    sci_b_spi_instance_ctrl_t *p_ctrl = (sci_b_spi_instance_ctrl_t *)ST7796U_SPI_INSTANCE.p_ctrl;
    p_ctrl->p_reg->CCR0_b.SSE = 1;
#endif

    /* Init sequence */
#if __ST7796U_DEBUG
    LOG_D(__FUNCTION__, "HardReset");
#endif
    hardReset();
    len_init_table = sizeof(sc_lcd_setting_table) / sizeof(sc_lcd_setting_table[0]);
#if __ST7796U_DEBUG
    LOG_D(__FUNCTION__, "Send init squence");
#endif
    for (i = 0; i < len_init_table; i++) {
        if (sc_lcd_setting_table[i].cmd == NULL) {
        #if __ST7796U_DEBUG
            LOG_D(__FUNCTION__, "Delay %u ms", sc_lcd_setting_table[i].length);
        #endif
            R_BSP_SoftwareDelay(sc_lcd_setting_table[i].length, BSP_DELAY_UNITS_MILLISECONDS);
        }
        else {
        #if __ST7796U_DEBUG
            LOG_SetAutoEndl(0);
            LOG_D(__FUNCTION__, "Write cmd: 0x%02X", *sc_lcd_setting_table[i].cmd);
            if (sc_lcd_setting_table[i].length) {
                LOG_Puts(". val: ");
                for (int j = 0; j < sc_lcd_setting_table[i].length; j++) {
                    LOG_Printf("0x%02X ", sc_lcd_setting_table[i].val[j]);
                }
            }
            LOG_PutsEndl(NULL);
            LOG_SetAutoEndl(1);
        #endif
            writeRegister(sc_lcd_setting_table[i].cmd, sc_lcd_setting_table[i].val, sc_lcd_setting_table[i].length);
        }
    }

    R_BSP_SoftwareDelay(10, BSP_DELAY_UNITS_MILLISECONDS);
    readRegister(&sc_cmd_rddid, data_read, 4);
    waitTransferDone(DEFAULT_TIMEOUT);
#if __ST7796U_DEBUG
    LOG_D(__FUNCTION__, "ID1: 0x%02X, ID2: 0x%02X, ID3: 0x%02X", data_read[1], data_read[2], data_read[3]);
#endif
    readRegister(&sc_cmd_rddst, data_read, 5);
#if __ST7796U_DEBUG
    LOG_SetAutoEndl(0);
    LOG_D(__FUNCTION__, "Display status:");
    for (i = 1; i < 5; i++) {
    	LOG_Printf(" 0x%02X", data_read[i]);
    }
    LOG_PutsEndl(NULL);
    LOG_SetAutoEndl(1);
#endif

    const sci_b_spi_extended_cfg_t *p_extend = (sci_b_spi_extended_cfg_t *)ST7796U_SPI_INSTANCE.p_cfg->p_extend;
    s_spi_write_clk_config.clk_div = p_extend->clk_div;
    s_spi_write_clk_config.clock_source = p_extend->clock_source;

