renesas/cpk_examples/cpk_ra8t2/st7796u_lcd_spi_cpk_ra8t2_ep/e2studio_llvm/src/lcd/lcd_st7796u.c
#if ST7796U_4SPI_EN_CACHE
#if ST7796U_4SPI_EN_DOUBLE_CACHE
    memset(s_spi_frame_cache, 0xFF, ST7796U_CACHE_SIZE * 2);
    s_spi_frame_current = 0;
#else
    memset(s_spi_frame_cache, 0xFF, ST7796U_CACHE_SIZE);
#endif
#endif

#else
#error "Unimplemented interface"
#endif /* #if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI */
    device->width = 480;
    device->length = 222;
    device->color_format = COLOR_FORMAT_RGB565;
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
    device->width_dummy = 0;
    device->length_dummy = 0;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
    device->width_dummy = 0;
    device->length_dummy = 34;
#endif
    /* sc_lcd_setting_table sets screen oritation to vertical */
    if (device->orientation != SCREEN_ORIENTATION_VERTICAL) {
    	LCD_PortSetOrientation(device, device->orientation);
    }

    LCD_PortFillScreen(device, 0xFFFF);
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
    waitTransferDone(DEFAULT_TIMEOUT * 2);
#endif
    /* Don't know why doesn't the above statement work in RA8T2. */
    LCD_PortFillScreen(device, 0xFFFF);

    return 0;
}

/**
 * @brief	Set backlight
 * @note	AW9364 didn't connect to MCU on this board, so this function is useless.
 * @bug		When it is called multiple times, the brightness of the backlight will be incorrect.
 * @param	device A lcd device point, can accept NULL because it is not actually used.
 * @param	bl     Range 0-16
 * @retval	Always return FSP_ERR_UNSUPPORTED
 */
uint32_t LCD_PortSetBacklight(LCD_Device *device, uint8_t bl)
{
	(void)device;
	(void)bl;

	return FSP_ERR_UNSUPPORTED;
}

/**
 * @brief	Set screen orientation
 * @note	Not yet verified. Don't call this function
 * @param	device      A lcd device pointer
 * @param	orientation New orientation
 * @return	Always return 0
 */
uint32_t LCD_PortSetOrientation(LCD_Device *device, LCD_ScreenOrientation orientation)
{
#if __ST7796U_INTERFACE == ST7796U_INTERFACE_MIPI
	(void)device;
	(void)orientation;
#elif __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
	uint8_t data_write[4];

#if __ST7796U_DEBUG
	LOG_D(__FUNCTION__, "Change orientation to %d", orientation);
#endif
	waitTransferDone(DEFAULT_TIMEOUT);
	if (orientation == SCREEN_ORIENTATION_HORIZONTAL) {
		data_write[0] = 0x28;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_raset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->width = 222;
		device->length = 480;
	}
	else if (orientation == SCREEN_ORIENTATION_HORIZONTAL_FLIP) {
		data_write[0] = 0xE8;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_raset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->width = 222;
		device->length = 480;
	}
	else if (orientation == SCREEN_ORIENTATION_VERTICAL) {
		data_write[0] = 0x48;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->width = 480;
		device->length = 222;
	}
	else {
		data_write[0] = 0x88;
		writeRegister(&sc_cmd_madctl, data_write, 1);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[0] = 0x00;
		data_write[1] = 0x00;
		data_write[2] = 0x01;
		data_write[3] = 0x0E;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		data_write[2] = 0x01;
		data_write[3] = 0xDF;
		writeRegister(&sc_cmd_caset, data_write, 4);
		waitTransferDone(DEFAULT_TIMEOUT);
		device->width = 480;
		device->length = 222;
	}
	device->orientation = orientation;
#endif

	return 0;
}

/*============================ LOCAL FUNCTIONS ===============================*/
static void hardReset(void)
{
    R_BSP_PinAccessEnable();
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
    R_BSP_SoftwareDelay(100, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_LOW);
    R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MICROSECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
    R_BSP_SoftwareDelay(4, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_LOW);
    R_BSP_SoftwareDelay(5, BSP_DELAY_UNITS_MILLISECONDS);
    R_IOPORT_PinWrite(&g_ioport_ctrl, ST7796U_PIN_RESET, BSP_IO_LEVEL_HIGH);
}

#if __ST7796U_INTERFACE == ST7796U_INTERFACE_4SPI
static void readMemory(uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, &sc_cmd_ramrd, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
#if ST7796U_SPI_HARD_CS == 0
    s_spi_sequence_end = 1;
#endif
    setClock(SPI_CLK_READ);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Read(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
}

static void readRegister(const uint8_t *reg, uint8_t *val, uint32_t length)
{
    fsp_err_t err;

    /* Wait last transfer done */
    waitTransferDone(DEFAULT_TIMEOUT);
#if ST7796U_SPI_HARD_CS == 0
    /* Clear flag, start a spi transfer squence */
    s_spi_sequence_end = 0;
#endif

    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_LOW);
    R_BSP_PinWrite(ST7796U_PIN_SPI_CS, BSP_IO_LEVEL_LOW);
    setClock(SPI_CLK_WRITE);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Write(ST7796U_SPI_INSTANCE.p_ctrl, reg, 1, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Write command failed: 0x%X", err);
    waitTransferDone(DEFAULT_TIMEOUT);
    R_BSP_PinWrite(ST7796U_PIN_DCX, BSP_IO_LEVEL_HIGH);
#if ST7796U_SPI_HARD_CS == 0
    /* Set flag, interrupt callback can driver CS to high when spi transfer complete */
    s_spi_sequence_end = 1;
#endif
    setClock(SPI_CLK_READ);
    s_spi_transfer_done = 0;
    err = R_SCI_B_SPI_Read(ST7796U_SPI_INSTANCE.p_ctrl, val, length, SPI_BIT_WIDTH_8_BITS);
    UNLIKE_RETURN(err, FSP_SUCCESS, "Read API failed: 0x%X", err);
}

/**
 * @brief   Switch SPI clock. ST7796U has different maximum clock when reading and writing.
 * @param   select SPI_CLK_READ: Switch to slow clock. SPI_CLK_WRITE: Switch to fast clock.
 */
static void setClock(lcd_spi_clk_select_t select)
{
    const sci_b_spi_extended_cfg_t *p_cfg;
    R_SCI_B0_Type *p_reg = ((sci_b_spi_instance_ctrl_t *)ST7796U_SPI_INSTANCE.p_ctrl)->p_reg;

